CommunityGD32Cores/GD32Firmware/GD32L23x/GD32L23x_standard_peripheral/Source/gd32l23x_rcu.c
    /* calculate APB1 clock frequency */
    idx = GET_BITS(RCU_CFG0, 8, 10);
    clk_exp = apb1_exp[idx];
    apb1_freq = ahb_freq >> clk_exp;

    /* calculate APB2 clock frequency */
    idx = GET_BITS(RCU_CFG0, 11, 13);
    clk_exp = apb2_exp[idx];
    apb2_freq = ahb_freq >> clk_exp;

    /* return the clocks frequency */
    switch(clock) {
    case CK_SYS:
        ck_freq = cksys_freq;
        break;
    case CK_AHB:
        ck_freq = ahb_freq;
        break;
    case CK_APB1:
        ck_freq = apb1_freq;
        break;
    case CK_APB2:
        ck_freq = apb2_freq;
        break;
    case CK_ADC:
        /* calculate ADC clock frequency */
        if(RCU_ADCSRC_AHB_APB2DIV != (RCU_CFG2 & RCU_CFG2_ADCSEL)) {
            adc_freq = IRC48M_VALUE;
        } else {
            /* ADC clock select CK_APB2 divided by 2/4/6/8 or CK_AHB divided by 3/5/7/9 */
            adcps = GET_BITS(RCU_CFG0, 14, 15);
            adcps2 = GET_BITS(RCU_CFG2, 30, 31);
            switch(adcps) {
            case 0:
                if(0U == adcps2) {
                    adc_freq = apb2_freq / 2U;
                } else if(1U == adcps2) {
                    adc_freq = apb2_freq / 10U;
                } else if(2U == adcps2) {
                    adc_freq = ahb_freq / 3U;
                } else if(3U == adcps2) {
                    adc_freq = ahb_freq / 11U;
                } else {
                }
                break;
            case 1:
                if(0U == adcps2) {
                    adc_freq = apb2_freq / 4U;
                } else if(1U == adcps2) {
                    adc_freq = apb2_freq / 12U;
                } else if(2U == adcps2) {
                    adc_freq = ahb_freq / 5U;
                } else if(3U == adcps2) {
                    adc_freq = ahb_freq / 13U;
                } else {
                }
                break;
            case 2:
                if(0U == adcps2) {
                    adc_freq = apb2_freq / 6U;
                } else if(1U == adcps2) {
                    adc_freq = apb2_freq / 14U;
                } else if(2U == adcps2) {
                    adc_freq = ahb_freq /  7U;
                } else if(3U == adcps2) {
                    adc_freq = ahb_freq / 15U;
                } else {
                }
                break;
            case 3:
                if(0U == adcps2) {
                    adc_freq = apb2_freq / 8U;
                } else if(1U == adcps2) {
                    adc_freq = apb2_freq / 16U;
                } else if(2U == adcps2) {
                    adc_freq = ahb_freq /  9U;
                } else if(3U == adcps2) {
                    adc_freq = ahb_freq / 17U;
                } else {
                }
                break;
            default:
                break;
            }
        }
        ck_freq = adc_freq;
        break;
    case CK_USART0:
        /* calculate USART0 clock frequency */
        if(RCU_USART0SRC_CKAPB2 == (RCU_CFG2 & RCU_CFG2_USART0SEL)) {
            usart_freq = apb2_freq;
        } else if(RCU_USART0SRC_CKSYS == (RCU_CFG2 & RCU_CFG2_USART0SEL)) {
            usart_freq = cksys_freq;
        } else if(RCU_USART0SRC_LXTAL == (RCU_CFG2 & RCU_CFG2_USART0SEL)) {
            usart_freq = LXTAL_VALUE;
        } else if(RCU_USART0SRC_IRC16MDIV == (RCU_CFG2 & RCU_CFG2_USART0SEL)) {
            /* calculate IRC16MDIV clock frequency */
            idx = GET_BITS(RCU_CFG2, 18, 20);
            clk_exp = IRC16M_exp[idx];
            usart_freq = IRC16M_VALUE >> clk_exp;
        } else {
        }
        ck_freq = usart_freq;
        break;
    case CK_USART1:
        /* calculate USART1 clock frequency */
        if(RCU_USART1SRC_CKAPB1 == (RCU_CFG2 & RCU_CFG2_USART1SEL)) {
            usart_freq = apb1_freq;
        } else if(RCU_USART1SRC_CKSYS == (RCU_CFG2 & RCU_CFG2_USART1SEL)) {
            usart_freq = cksys_freq;
        } else if(RCU_USART1SRC_LXTAL == (RCU_CFG2 & RCU_CFG2_USART1SEL)) {
            usart_freq = LXTAL_VALUE;
        } else if(RCU_USART1SRC_IRC16MDIV == (RCU_CFG2 & RCU_CFG2_USART1SEL)) {
            /* calculate IRC16MDIV clock frequency */
            idx = GET_BITS(RCU_CFG2, 18, 20);
            clk_exp = IRC16M_exp[idx];
            usart_freq = IRC16M_VALUE >> clk_exp;
        } else {
        }
        ck_freq = usart_freq;
        break;
    case CK_LPUART:
        /* calculate LPUART clock frequency */
        if(RCU_LPUARTSRC_CKAPB1 == (RCU_CFG2 & RCU_CFG2_LPUARTSEL)) {
            usart_freq = apb1_freq;
        } else if(RCU_LPUARTSRC_CKSYS == (RCU_CFG2 & RCU_CFG2_LPUARTSEL)) {
            usart_freq = cksys_freq;
        } else if(RCU_LPUARTSRC_LXTAL == (RCU_CFG2 & RCU_CFG2_LPUARTSEL)) {
            usart_freq = LXTAL_VALUE;
        } else if(RCU_LPUARTSRC_IRC16MDIV == (RCU_CFG2 & RCU_CFG2_LPUARTSEL)) {
            /* calculate IRC16MDIV clock frequency */
            idx = GET_BITS(RCU_CFG2, 18, 20);
            clk_exp = IRC16M_exp[idx];
            usart_freq = IRC16M_VALUE >> clk_exp;
        } else {
        }
        ck_freq = usart_freq;
        break;
    case CK_LPTIMER:
        /* calculate LPTIMER clock frequency */
        if(RCU_LPTIMERSRC_CKAPB1 == (RCU_CFG2 & RCU_CFG2_LPTIMERSEL)) {
            lptimer_freq = apb1_freq;
        } else if(RCU_LPTIMERSRC_IRC32K == (RCU_CFG2 & RCU_CFG2_LPTIMERSEL)) {
            lptimer_freq = IRC32K_VALUE;
        } else if(RCU_LPTIMERSRC_LXTAL == (RCU_CFG2 & RCU_CFG2_LPTIMERSEL)) {
            lptimer_freq = LXTAL_VALUE;
        } else if(RCU_LPTIMERSRC_IRC16MDIV == (RCU_CFG2 & RCU_CFG2_LPTIMERSEL)) {
            /* calculate IRC16MDIV clock frequency */
            idx = GET_BITS(RCU_CFG2, 18, 20);
            clk_exp = IRC16M_exp[idx];
            usart_freq = IRC16M_VALUE >> clk_exp;
        } else {
        }
        ck_freq = lptimer_freq;
        break;
    default:
        break;
    }
    return ck_freq;
}
